src/angle_value_0.364/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       9850;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          33;
        startFace       9900;
    }
    wedge
    {
        type            patch;
        nFaces          67;
        startFace       9933;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       10000;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5000;
        startFace       10100;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          5000;
        startFace       15100;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       20100;
    }
)

// ************************************************************************* //
